[
    {
        "id": 1,
        "city": "Shang Hai",
        "infor": "The largest city in China and eighth largest in the world.The name Shanghai is literally translated as On the Ocean or City on the Ocean; however, Shanghai, having a prosperous and international history, has also been known as “The Paris of The East.",
        "administrativeLevel": "municipality",
        "image": "http://seopic.699pic.com/photo/50032/3300.jpg_wh1200.jpg",
        "population": 24000000
    },
    {
        "id": 2,
        "city": "Bei Jing",
        "infor": "With a history of more than 3,000 years, it has been an integral part of China's history. There is scarcely a major building that doesn't have at least some national historical significance. Being the capital of China for about 850 years, it is one of the Four Great Ancient Capitals of China, offering China's most wonderful array of attractions.",
        "administrativeLevel": "municipality",
        "image": "http://a3.att.hudong.com/13/90/50200009239445155792907173911.jpg",
        "population": 21540000
    },
    {
        "id": 3,
        "city": "Hong Kong",
        "infor": "Hong Kong is a cosmopolitan metropolis where old tradition blends perfectly with Western culture and post-modern trends. Ethnic Chinese make up the bulk of its population, but there is also a sizeable presence of expatriates and people of different ethnicity, all enjoying the freedoms and prosperity of this city, once a fishing village.",
        "administrativeLevel": "Special Administrative Region",
        "image": "http://www.asianews.it/files/img/HONG_KONG_-_0915_-_Libert%C3%A0.jpg",
        "population": 7392000
    },
    {
        "id": 4,
        "city": "Macau",
        "infor": "Macau was formerly a colony of the Portuguese Empire, after Ming China leased the territory as a trading post in 1557. Portugal governed the area under titular Chinese sovereignty and authority until 1887, when it was given perpetual colonial rights for Macau. The colony remained under Portuguese rule until 1999, when it was transferred to China.",
        "administrativeLevel": "Special Administrative Region",
        "image": "https://image.shutterstock.com/z/stock-photo-macau-city-skyline-at-sunset-1006756141.jpg",
        "population": 622567
    }
]